
## Plan Result

[CI link](https://github.com/scarowar/test-tf-branch-deploy/actions/runs/20827787635)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.test


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = <<-EOT
            Environment: prod
            Message: Production environment test
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment = "prod"
  + file_path   = "./output.txt"
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":124,"Program":"tfcmt","SHA1":"9b9305c62f24db41a3a6c65faf763de871114878","Vars":{},"WorkflowName":"2️⃣ Advanced Deploy (With Hook)"} -->